package step.learning.threading;

public class ThreadDemo {
    public  void run()
    {
        System.out.println("ThreadDemo");
    }
}
/**
 Багато поточність та асинхроггість
 (А)Синхроність - розподіл коду у часі
 - синхронність (синхронний код) - код виконується послідовно, інструкція за інструкцією
 - асинхронність - можливість у певний проміжок часу одночасного виконання інструкцій

 Багатопоточність - програмування з використанням системних об'єктів "потоки"


 Багато процесність - виконання кількох системних об'єктів (процес)

 Grid-, Network- використання вузлів, поєднаних у мережу

 * **/